PurchaseRequest/test/TestApprove.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pur="http://domain.com/purchaserequest">
   <soapenv:Header/>
   <soapenv:Body>
      <pur:purchaseRequest>
         <pur:Header>
            <pur:Approval>?</pur:Approval>
         </pur:Header>
      </pur:purchaseRequest>
   </soapenv:Body>
</soapenv:Envelope>